// // 1. Сумма двух чисел
// // Напишите функцию, которая принимает два числа и возвращает их сумму.

// function sum(a, b) {
//     return (a + b)
// }
// // console.log(sum(1, 3))  //возвращает 4

// // 2. Проверка на четность
// // Напишите функцию, которая проверяет, является ли число четным.

// function result (i) {
//     return (i%2);
    
// }
// // console.log(result(6))    //проверка на четность - 3 

// // 3. Нахождение максимального числа
// // Напишите функцию, которая принимает три числа и возвращает наибольшее из них.


// function numMax (a, b, c) {
//     return Math.max(a, b, c)
// }
// // console.log(numMax(5, 7, 9));

// // 4. Преобразуйте строку в число
// // Напишите функцию, которая может преобразовать строку в число. "1234" --> 1234

// function str(a) {
//     return Number(a)
// }
// // console.log(str('1234'));

// // 5.Преобразовать логические значения в строки «Да» или «Нет»
// // Завершите метод, который принимает логическое значение и возвращает "Yes"строку для true или "No" строку для false.

// function method (b) {
//     if (b===true)
//         return ("Yes")
//     else (b===false)
//         return ('No')
// }
// method(true)   //Yes / No  

// // 6. Противоположное число.
// // напишите стрелочную функцию в одну строку которая возвращает противоположное число

// const oppositeNumber = (a) => {-a}
// // console.log(oppositeNumber(5));  //-5

// // 7. Вывод чисел от 1 до N
// // Напишите цикл, который выводит числа от 1 до N.
// // Ожидаемый результат: 1, 2, 3, 4, 5


// // outputOfNumbers(10)    //1,2,3,4,5

// // 8. Сумма чисел от 1 до N
// // Напишите цикл, который вычисляет сумму чисел от 1 до N.


// // 9. Таблица умножения
// // Напишите цикл, который выводит таблицу умножения для числа N.

// function table(n) {
//     for(i=0; i<=10; i++){
//         console.log(`${n} + ${i} = ${i+n}`);
//     }
// }

// table(5)

